<a href="https://colab.research.google.com/github/19pa1a0220/AI-LAB/blob/master/AI-Lab_Experiment-2_PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#EXPERIMENT-2_PANDAS

In [ ]:
import pandas as pd
import numpy as np

##1) Create a dataframe manually

In [ ]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
df=pd.DataFrame([["1","ROCKY",18],["2","HONEY",16],["3","HUSSY",15]],columns=["Roll No","Name","Age"])
df

  Roll No   Name  Age
0       1  ROCKY   18
1       2  HONEY   16
2       3  HUSSY   15

##2)import data into a dataframe

In [8]:
import pandas as pd
df = pd.read_csv('students_placement_data.csv')
df

     Roll No Gender  ... registered_for_ Placement_Training  placement status
0          1      M  ...                                 NO        Not placed
1          2      F  ...                                yes            Placed
2          3      F  ...                                yes        Not placed
3          4      M  ...                                yes        Not placed
4          5      M  ...                                yes        Not placed
..       ...    ...  ...                                ...               ...
112      113      M  ...                                 NO        Not placed
113      114      M  ...                                 NO        Not placed
114      115      M  ...                                 NO        Not placed
115      116      M  ...                                 NO        Not placed
116      117      M  ...                                 NO        Not placed

[117 rows x 9 columns]

In [9]:
df = pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

In [10]:
df.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [15]:
df.describe()

          Roll No  SSC Percentage  ...  B.Tech_percentage    Backlogs
count  117.000000      116.000000  ...         117.000000  117.000000
mean    59.000000       80.474569  ...          62.943419    4.111111
std     33.919021        8.836079  ...          12.064306    6.335148
min      1.000000       47.800000  ...          31.200000    0.000000
25%     30.000000       76.622500  ...          54.180000    0.000000
50%     59.000000       82.745000  ...          64.360000    0.000000
75%     88.000000       87.025000  ...          72.570000    7.000000
max    117.000000       93.660000  ...          88.100000   25.000000

[8 rows x 5 columns]

In [14]:
df.shape

(117, 10)

##3) Adding, Deleting, Modifying the rows/columns in a dataframe

###3.1) Adding a column

In [16]:
host_day = pd.read_csv('hostlers_day_scholars.csv')
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [17]:
host_day.shape

(117, 1)

In [ ]:
df["hostler/days scholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostler/days scholar
0        1      M  ...       Not placed                     d
1        2      F  ...           Placed                     d
2        3      F  ...       Not placed                     d
3        4      M  ...       Not placed                     d
4        5      M  ...       Not placed                     h

[5 rows x 10 columns]

###3.2) Deleting a column

In [ ]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  B.Tech_percentage  Backlogs  placement status
0        1      M       A  ...              40.00        18        Not placed
1        2      F       A  ...              71.45         0            Placed
2        3      F       A  ...              45.26        13        Not placed
3        4      M       A  ...              36.47        17        Not placed
4        5      M       A  ...              42.52        17        Not placed

[5 rows x 8 columns]

###3.3) Adding a row

In [ ]:
df1=pd.DataFrame({'Roll No': [118],'Gender': ['F'],'Section': ['c'],'SSC Percentage': [98.4],'inter_Diploma_percentage':[99],'B.Tech_percentage':[75],'Backlogs': [0],'registered_for_ Placement_Training': ["Not applicable"],'placement status': ["Not placed"],"hostler/days scholar":["h"]},index=[117])
df1

     Roll No Gender  ... placement status  hostler/days scholar
117      118      F  ...       Not placed                     h

[1 rows x 10 columns]

In [ ]:
df=df.append(df1)
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  hostler/days scholar
0        1      M  ...                                NaN                   NaN
1        2      F  ...                                NaN                   NaN
2        3      F  ...                                NaN                   NaN
3        4      M  ...                                NaN                   NaN
4        5      M  ...                                NaN                   NaN

[5 rows x 10 columns]

In [ ]:
df=df.append(df1)
df.head(118)

     Roll No Gender  ... registered_for_ Placement_Training  hostler/days scholar
0          1      M  ...                                NaN                   NaN
1          2      F  ...                                NaN                   NaN
2          3      F  ...                                NaN                   NaN
3          4      M  ...                                NaN                   NaN
4          5      M  ...                                NaN                   NaN
..       ...    ...  ...                                ...                   ...
113      114      M  ...                                NaN                   NaN
114      115      M  ...                                NaN                   NaN
115      116      M  ...                                NaN                   NaN
116      117      M  ...                                NaN                   NaN
117      118      F  ...                     Not applicable                     h

[118 rows x 10 columns]

###3.4) Deleting a row

In [ ]:
df=df.drop(3)
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  hostler/days scholar
0        1      M  ...                                NaN                   NaN
1        2      F  ...                                NaN                   NaN
2        3      F  ...                                NaN                   NaN
4        5      M  ...                                NaN                   NaN
5        6      M  ...                                NaN                   NaN

[5 rows x 10 columns]

###3.5) Modifying elements

In [ ]:
df.loc[1,"hostler/days scholar"]="h"
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  hostler/days scholar
0        1      M  ...                                NaN                   NaN
1        2      F  ...                                NaN                     h
2        3      F  ...                                NaN                   NaN
4        5      M  ...                                NaN                   NaN
5        6      M  ...                                NaN                   NaN

[5 rows x 10 columns]

##4) Applying functions on a dataframe

In [ ]:
def incre(a):
    if(a<70):
      return(a+0.05)
    else:
      return(a)

In [ ]:
df["B.Tech_percentage"]=df["B.Tech_percentage"].apply(incre)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                     d
1        2      F       A  ...         0            Placed                     h
2        3      F       A  ...        13        Not placed                     d
4        5      M       A  ...        17        Not placed                     h
5        6      M       A  ...         6        Not placed                     h

[5 rows x 9 columns]

##5) Iterations on dataframe

In [ ]:
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
    print(rows["Roll No"],"-",rows["B.Tech_percentage"])

18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38

##6) Accessing the elements from a dataframe

In [ ]:
df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

##7) Different ways to deal with NAâ€™s in dataframe

In [ ]:
import numpy as np
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  hostler/days scholar
0        1      M  ...                                NaN                   NaN
1        2      F  ...                                NaN                     h
2        3      F  ...                                NaN                   NaN
4        5      M  ...                                NaN                   NaN
5        6      M  ...                                NaN                   NaN

[5 rows x 10 columns]

##8) Groupby operations on dataframe

In [ ]:
grouped=df.groupby("Gender")
grouped["B.Tech_percentage"].agg(np.mean)

Gender
F    71.348431
M    57.300597
Name: B.Tech_percentage, dtype: float64

##9) Merging the dataframes

In [12]:
df2=pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [13]:
import pandas as pd
df=pd.merge(df,df2,on= 'Roll No')
df.head()

   Roll No Gender  ... placement status  Urban/Rural
0        1      M  ...       Not placed        Urban
1        2      F  ...           Placed        Rural
2        3      F  ...       Not placed        Urban
3        4      M  ...       Not placed        Urban
4        5      M  ...       Not placed        Urban

[5 rows x 10 columns]